docs/1c-export-2026-06-02/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписание</Name>
					<Comment>(Общ) Дополнительное описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииПриОбращении</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидДеятельности</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджерПокупателя</Name>
					<Comment>(Упр) Основной менеджер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРаботыСтрокой</Name>
					<Comment>(Общ) Расписание работы строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЗаказаПоставщиком</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>(Регл) Код по ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства плательщика НДС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяРезидентом</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаККонтрагенту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФилиала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭДО1СЗвит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДляНеплановыхПродаж</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Области</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВідділенняНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйСтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАсортимета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыАсортимета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Геолокация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъмЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕМейл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтПоследнейПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПошуку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналиПошуку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОновлення</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПокупки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДеятельности</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МенеджерыПокупателя</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МенеджерПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНомераТелефонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидМесенджера</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыМесендеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Асортимент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчетаДляОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АсортиментПрезентацій</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоцМережі</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коментар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Посилання</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мережа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидиСоцМереж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПосиланняВБраузері</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/Контрагенты/Ext/ObjectModule.bsl
Перем мОснование;
Перем мОбменАндроид Экспорт;


// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.ОсновнойДоговорКонтрагента = Неопределено;
		ЭтотОбъект.ОсновнойБанковскийСчет     = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Функция возвращает результат запроса по справочнику контрагентов с заданным головным контрагентом
//
// Параметры:
//  ГоловнойКонтрагент - заданный головной контрагент
//
// Возвращаемое значение:
//  Результат - результат работы запроса
// 
Функция ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(ГоловнойКонтрагент) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГоловнойКонтрагент", ГоловнойКонтрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Организации") Тогда
		
		Наименование           = Основание.Наименование;
		ЮрФизЛицо              = Основание.ЮрФизЛицо;
		НаименованиеПолное     = Основание.НаименованиеПолное;
		ОсновнойБанковскийСчет = Основание.ОсновнойБанковскийСчет;
		ИНН                    = Основание.ИНН;
		КодПоЕДРПОУ			   = Основание.КодПоЕДРПОУ;
		мОснование             = Основание;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ)
	Перем мСсылкаНового;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	Если НЕ ОбменДанными.Загрузка Тогда
		
		// Проверим основной вид деятельности контрагента
		Если ЗначениеЗаполнено(ОсновнойВидДеятельности) И ВидыДеятельности.Найти(ОсновнойВидДеятельности, "ВидДеятельности") = Неопределено Тогда
			ОсновнойВидДеятельности = Справочники.ВидыДеятельностиКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель, мСсылкаНового);
		
		// установим головного контрагента если он не заполнен
		Если НЕ ЭтоГруппа Тогда
			Если НЕ ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
				Если ЭтоНовый() Тогда
					ГоловнойКонтрагент = мСсылкаНового;
				Иначе
					ГоловнойКонтрагент = Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЭтоГруппа Тогда 
			НомерТелефона = ОбработкаНомераТелефона(НомерТелефона);
			Если НЕ мОбменАндроид И ЗначениеЗаполнено(НомерТелефона) Тогда 
//ЗаписьЖурналаРегистрации("НОМЕР_ТЕЛЕФОНА", УровеньЖурналаРегистрации.Информация, ,,НомерТелефона);
				УникальностьНомераТелефона(НомерТелефона, Отказ);
			КонецЕсли;
			
			Для Каждого Стр Из ДополнительныеНомераТелефонов Цикл
				Стр.Номер = ОбработкаНомераТелефона(Стр.Номер);
				Если НЕ мОбменАндроид И ЗначениеЗаполнено(НомерТелефона) Тогда
					//ЗаписьЖурналаРегистрации("НОМЕР_ТЕЛЕФОНА", УровеньЖурналаРегистрации.Информация, ,,НомерТелефона);

					УникальностьНомераТелефона(Стр.Номер, Отказ);
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//++
	Если ЭтоНовый()
		И НЕ ЭтоГруппа
		И Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;	
	//++
	
	Если НЕ Отказ Тогда 
		Если ЗначениеЗаполнено(Ссылка) Тогда 
			Общий.ЗаписЖурналРеєстраціїЗіСтекомВикликів("ЗмінаНазвиКонтрагента", "" +  Ссылка.Наименование + " - " + Наименование + " + " + Ссылка.ДатаОновлення + " - " + ДатаОновлення);			
			Если НЕ ЭтоНовый() Тогда 
				КонтрольВерсийПерезапису();
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ЗначениеЗаполнено(НомерТелефона) Тогда 
			Отказ = НЕ Общий.КонтрольУникальностиПоРеквизиту(ЭтотОбъект, "НомерТелефона");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГоловнойКонтрагент) И ГоловнойКонтрагент <> Ссылка Тогда
			
			Если ЗначениеЗаполнено(ГоловнойКонтрагент.ГоловнойКонтрагент) И ГоловнойКонтрагент.ГоловнойКонтрагент <> ГоловнойКонтрагент Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Контрагент "+СокрЛП(ГоловнойКонтрагент)+" не может быть выбран головным, 
								|так как для него уже был назначен головной контрагент "+СокрЛП(ГоловнойКонтрагент.ГоловнойКонтрагент)+"!");
				Отказ = Истина;
				Возврат;
			Иначе
				
				// надо проверить, что если указываем головного контрагента, то этот элемент уже не был установлен
				// в качестве головного у другого контрагента.
				ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();
				Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда
					
					СообщениеОНевозможностиЗаписи = "Контрагент "+СокрЛП(ЭтотОбъект)+" не может иметь головного контрагента!
													|Этот контрагент уже установлен головным для: ";
					Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
						СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуКонтрагенту.Контрагент);
					КонецЦикла;
					
					ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи);
					Отказ = Истина;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(мОснование) Тогда
			НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Контрагент = Ссылка;
			ЗаписьРегистра.ВидСвязи   = Перечисления.ВидыСобственныхКонтрагентов.Организация;
			ЗаписьРегистра.Объект     = мОснование;
			НаборЗаписей.Записать(Ложь);
			мОснование = "";
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа И НЕ Отказ Тогда
		ЭтоНовый = Ложь;
		
		Если ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый) 
				И ЭтоНовый = Истина Тогда 
			Продавец = Неопределено;
		Иначе
			ДополнительныеСвойства.Свойство("ТорговыйАгент", Продавец);
		КонецЕсли;
		
		ОбменАндроид.ЗарегистрироватьОбъектОбменАндроид(Ссылка,, Продавец);

	КонецЕсли;
	Если НЕ Отказ И НЕ ЭтоГруппа Тогда 
		ОновитиНомераТелефонівКонтрагента();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОновитиНомераТелефонівКонтрагента()
	нз = РегистрыСведений.РеєстрНомерівТелефонів.СоздатьНаборЗаписей();
	нз.Отбор.Контрагент.Установить(Ссылка);
	нз.Прочитать();
	НомериВідповідають = Истина;
	СЗ = Новый Массив;
	Для Каждого Стр Из нз Цикл
		СЗ.Добавить(Стр.Телефон);
		Если Стр.Телефон <> НомерТелефона И ДополнительныеНомераТелефонов.Найти(Стр.Телефон, "Номер") = Неопределено Тогда 
			НомериВідповідають = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если НомериВідповідають И ЗначениеЗаполнено(НомерТелефона) Тогда 
		Если СЗ.Найти(НомерТелефона) = Неопределено Тогда 
			НомериВідповідають = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Если НомериВідповідають Тогда
		Для Каждого Стр Из ДополнительныеНомераТелефонов Цикл
			Если СЗ.Найти(Стр.Номер) = Неопределено Тогда 
				НомериВідповідають = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ НомериВідповідають Тогда 
		нз.Очистить();
		Если ЗначениеЗаполнено(НомерТелефона) Тогда 
			НовСтр = нз.Добавить();
			НовСтр.Контрагент = Ссылка;
			НовСтр.Телефон = НомерТелефона;
		КонецЕсли;
		Для Каждого Стр Из ДополнительныеНомераТелефонов Цикл
			Если Стр.Номер <> НомерТелефона Тогда 
				НовСтр = нз.Добавить();
				НовСтр.Контрагент = Ссылка;
				НовСтр.Телефон = Стр.Номер;
			КонецЕсли;
		КонецЦикла;
		нз.Записать();
	КонецЕсли;
	

	
	
КонецПроцедуры

Процедура УникальностьНомераТелефона(НомерДляПроверки, Отказ) Экспорт
	
	Если ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;	
	
	НовыйТелефон = ОбработкаНомераТелефона(НомерДляПроверки);
	ЗапросНомеров = Новый Запрос;
	Если ЭтоНовый() Тогда 
		ЗапросНомеров.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НомерТелефона,
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтрагентыДополнительныеНомераТелефонов.Номер,
		|	КонтрагентыДополнительныеНомераТелефонов.Ссылка
		|ИЗ
		|	Справочник.Контрагенты.ДополнительныеНомераТелефонов КАК КонтрагентыДополнительныеНомераТелефонов";
	Иначе 
		ЗапросНомеров.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НомерТелефона,
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка <> &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтрагентыДополнительныеНомераТелефонов.Номер,
		|	КонтрагентыДополнительныеНомераТелефонов.Ссылка
		|ИЗ
		|	Справочник.Контрагенты.ДополнительныеНомераТелефонов КАК КонтрагентыДополнительныеНомераТелефонов
		|ГДЕ
		|	КонтрагентыДополнительныеНомераТелефонов.Ссылка <> &Ссылка";
		ЗапросНомеров.УстановитьПараметр("Ссылка", Ссылка);
	КонецЕсли;
	
	ТЗНомера = ЗапросНомеров.Выполнить().Выгрузить();
	Для Каждого СтрНомер Из ТЗНомера Цикл 
		Если (НовыйТелефон <> "") И (НовыйТелефон = СтрНомер.НомерТелефона) Тогда 
			Отказ = Истина;
			ВызватьИсключение "Номер телефону контрагента не унікальний! " + СтрНомер.Контрагент + " ,Номер: " + НовыйТелефон;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

Функция ОбработкаНомераТелефона(Телефон) Экспорт 
	
	Если ЭтоГруппа Тогда
		Возврат "";
	КонецЕсли;		
	
	Телефон = СтрЗаменить(Телефон,")","");
	Телефон = СтрЗаменить(Телефон,"(","");
	Телефон = СтрЗаменить(Телефон,"+38","");
	Телефон = СтрЗаменить(Телефон,"-","");
	Телефон = СтрЗаменить(Телефон,"_","");
	Телефон = СтрЗаменить(Телефон,".","");
	Телефон = СтрЗаменить(Телефон,",","");
	Телефон = СтрЗаменить(Телефон,"}","");
	Телефон = СтрЗаменить(Телефон,"{","");
	Телефон = СтрЗаменить(Телефон,"=","");
	Телефон = СтрЗаменить(Телефон," ","");
	Телефон = СтрЗаменить(Телефон,":","");
	Если СтрДлина(Телефон) > 13 Тогда 
		Если Сред(СокрЛП(Телефон),1,3) = "+38" Тогда
			Телефон = Сред(СокрЛП(Телефон),3);
		КонецЕсли;	
	ИначеЕсли СтрДлина(Телефон) = 12 Тогда 		
		Телефон = Прав(Телефон, 10); 
	КонецЕсли;
	
	Возврат СокрЛП(Телефон);
	
КонецФункции

Процедура КонтрольВерсийПерезапису()
	Если НЕ ЭтоНовый() И Не ЭтоГруппа И Ссылка.ДатаОновлення > ДатаОновлення Тогда 
		СтрСохр = Новый Структура;
		СтрСохр.Вставить("КоличествоДнейОтПоследнейПокупки", КоличествоДнейОтПоследнейПокупки);		
			
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Ссылка, , "Владелец");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтрСохр);
		
		Наименование = Ссылка.Наименование;
		
		ДополнительныеНомераТелефонов.Очистить();
		Для Каждого Стр Из Ссылка.ДополнительныеНомераТелефонов Цикл
			НовСтр = ДополнительныеНомераТелефонов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
		
		Маршруты.Очистить();
		Для Каждого Стр Из Ссылка.Маршруты Цикл
			НовСтр = Маршруты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
		
		Асортимент.Очистить();
		Для Каждого Стр Из Ссылка.Асортимент Цикл
			НовСтр = Асортимент.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;

		БанковскиеСчетаДляОплаты.Очистить();
		Для Каждого Стр Из Ссылка.БанковскиеСчетаДляОплаты Цикл
			НовСтр = БанковскиеСчетаДляОплаты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;

		АсортиментПрезентацій.Очистить();
		Для Каждого Стр Из Ссылка.АсортиментПрезентацій Цикл
			НовСтр = АсортиментПрезентацій.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры



мОбменАндроид = Ложь;
